test-plans/mcp-http-sse-50threads.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="MCPulse - HTTP+SSE 50 Threads" enabled="true">
      <stringProp name="TestPlan.comments">50-thread smoke test for persistent HTTP+SSE transport</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="HTTP+SSE 50-thread persistent" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlGui" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
      </ThreadGroup>
      <hashTree>
        <io.github.mcpsampler.McpSampler guiclass="io.github.mcpsampler.gui.McpSamplerGui" testclass="io.github.mcpsampler.McpSampler" testname="tools/list load (HTTP+SSE)" enabled="true">
          <stringProp name="McpSampler.transport">http+sse</stringProp>
          <stringProp name="McpSampler.httpBaseUrl">http://127.0.0.1:18080</stringProp>
          <stringProp name="McpSampler.httpSendPath">/message</stringProp>
          <stringProp name="McpSampler.ssePath">/events</stringProp>
          <stringProp name="McpSampler.sseCorrelationKey">id</stringProp>
          <stringProp name="McpSampler.sseConnectMode">per-thread</stringProp>
          <stringProp name="McpSampler.warmupMode">process</stringProp>
          <stringProp name="McpSampler.method">tools/list</stringProp>
          <stringProp name="McpSampler.clientName">mcpulse-http-sse-load</stringProp>
          <stringProp name="McpSampler.clientVersion">1.0.0</stringProp>
          <stringProp name="McpSampler.timeoutMs">15000</stringProp>
        </io.github.mcpsampler.McpSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert tools/list response code is 200 (HTTP+SSE load)" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert tools/list contains echo (HTTP+SSE load)" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1">echo</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>