test-plans/mcp-perf-cold-start.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="MCPulse - Perf Cold Start" enabled="true">
      <stringProp name="TestPlan.comments">Shows process startup overhead with many short-lived thread workers</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Cold Start Storm" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlGui" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">150</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
      </ThreadGroup>
      <hashTree>
        <io.github.mcpsampler.McpSampler guiclass="io.github.mcpsampler.gui.McpSamplerGui" testclass="io.github.mcpsampler.McpSampler" testname="tools/list cold-start" enabled="true">
          <stringProp name="McpSampler.command">python3</stringProp>
          <stringProp name="McpSampler.args">scripts/mock_perf_mcp_server.py --base-delay-ms 5</stringProp>
          <stringProp name="McpSampler.method">tools/list</stringProp>
          <stringProp name="McpSampler.clientName">mcpulse</stringProp>
          <stringProp name="McpSampler.clientVersion">1.0.0</stringProp>
        </io.github.mcpsampler.McpSampler>
        <hashTree/>

        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>